---
kind: enumMember
id: F:Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_MESH
enum: Autodesk.Revit.DB.ElementReferenceType
source: html/f664c172-bb88-463b-d8ad-5dd70a11dd5a.htm
---
# Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_MESH

The reference is to a mesh.